import 'package:simple_quiz_app/models/quiz_question.dart';

const questions = [
  QuizQuestion(
    'ПО РЕЗУЛЬТАТАМ ДИСПАНСЕРИЗАЦИИ ФОРМИРУЕТСЯ',
    [
      '3 группы',
      '1 группа',
      '2 группы',
      '4 группы',
    ],
  ),
  QuizQuestion(
      'ДИСПАНСЕРНОЕ НАБЛЮДЕНИЕ ПАЦИЕНТОВ БЕЗ ДОКАЗАННЫХ СЕРДЕЧНО-СОСУДИСТЫХ ЗАБОЛЕВАНИЙ С ВЫСОКИМ И ОЧЕНЬ ВЫСОКИМ СУММАРНЫМ СЕРДЕЧНО-СОСУДИСТЫМ РИСКОМ ОСУЩЕСТВЛЯЕТ',
      [
        'врач отделения медицинской профилактики, при отсутствии кабинета профилактики, например, в сельской местности – врач-терапевт участковый',
        'врач-терапевт участковый',
        'врач дневного стационара',
        'врач-кардиолог поликлиники',
      ]),
  QuizQuestion(
    'МЕДИКО-СОЦИАЛЬНАЯ ЭКСПЕРТИЗА ОСУЩЕСТВЛЯЕТСЯ',
    [
      'федеральными учреждениями медико-социальной экспертизы',
      'учреждениями медико-социальной экспертизы субъекта РФ',
      'городскими учреждениями медико-социальной экспертизы',
      'фондами ОМС',
    ],
  ),
  QuizQuestion(
    'КРАТКОЕ ПРОФИЛАКТИЧЕСКОЕ КОНСУЛЬТИРОВАНИЕ НА ЗАКЛЮЧИТЕЛЬНОМ ЭТАПЕ ДИСПАНСЕРИЗАЦИИ ПРОВОДИТ',
    [
      'врач-терапевт участковый',
      'врач отделения медицинской профилактики',
      'врач дневного стационара',
      'врач-кардиолог поликлиники',
    ],
  ),
  QuizQuestion(
    'КРАТКОЕ ПРОФИЛАКТИЧЕСКОЕ КОНСУЛЬТИРОВАНИЕ ЗАНИМАЕТ ___ МИНУТ',
    [
      '10',
      '30',
      '60',
      '5',
    ],
  ),
  QuizQuestion(
    'НАУЧНОЙ ОСНОВОЙ ПРОФИЛАКТИКИ ХРОНИЧЕСКИХ НЕИНФЕКЦИОННЫХ ЗАБОЛЕВАНИЙ ЯВЛЯЕТСЯ КОНЦЕПЦИЯ',
    [
      'факторов риска',
      'здорового образа жизни',
      'борьбы с вредными привычками',
      'индивидуальной профилактики',
    ],
  ),
  QuizQuestion(
    'ДИСПАНСЕРИЗАЦИЯ ПРОВОДИТСЯ',
    [
      '1 раз в 3 года',
      'каждый год',
      '1 раз в 2 года',
      '1 раз в полгода',
    ],
  ),
  QuizQuestion(
    'ИНВАЛИДНОСТЬ I ГРУППЫ УСТАНАВЛИВАЕТСЯ НА',
    [
      '2 года',
      '1 год',
      '3 года',
      'бессрочно',
    ],
  ),
  QuizQuestion(
    'ИНВАЛИДНОСТЬ II ГРУППЫ УСТАНАВЛИВАЕТСЯ НА',
    [
      '1 год',
      '3 года',
      'бессрочно',
      '2 года',
    ],
  ),
  QuizQuestion(
    'СТЕПЕНЬ УТРАТЫ ПРОФЕССИОНАЛЬНОЙ ТРУДОСПОСОБНОСТИ УСТАНАВЛИВАЕТСЯ В',
    [
      'процентах',
      'долях от целого',
      'десятичных долях',
      'субъективных характеристиках',
    ],
  ),
];
